# Brewfile
#
# Maintained by Claud D. Park <posquit0.bj@gmail.com>
# http://www.posquit0.com/


cask_args appdir: '/Applications'

### System {{{
  ## System Libraries
  # Manage compile and link flags for libraries
  brew 'pkg-config'
  # Text-based UI library
  brew 'ncurses'
  # GNU internationalization (i18n) and localization (l10n) library
  brew 'gettext'
  # Library for command-line editing
  brew 'readline'
  # Image manipulation library
  brew 'jpeg'

  ## Mac OS X
  brew 'm-cli'

  ## Monitoring
  brew 'htop', args: ['with-ncurses']
  # Display an interface's bandwidth usage
  brew 'iftop'
  # Top-like interface for container metrics
  brew 'ctop'
### }}}


### Web {{{
  ## Web Browser
  cask 'google-chrome'
  cask 'firefox-developer-edition'

  ## Flash Player for Web Browser
  # Adobe Flash Player NPAPI (plugin for Safari and Firefox)
  cask 'flash-npapi'
  # Adobe Flash Player PPAPI (plugin for Opera and Chromium)
  cask 'flash-ppapi'

  ## HTTP Request
  # Powerful HTTP and GraphQL tool belt
  cask 'insomnia'
  # API Development Environment
  cask 'postman'
### }}}


### Media {{{
  ## Video
  # VLC media player
  cask 'vlc'
  # Home theater/media center software and entertainment hub for digital media
  cask 'kodi'

  ## Image
  # Streamlined and convenient image viewer and browser
  cask 'xee'
### }}}


### Messaging {{{
  cask 'slack'
  cask 'telegram'
  cask 'skype'
### }}}


### Network {{{
  ## Analysis
  # The world’s foremost and widely-used network protocol analyzer
  cask 'wireshark'
  # Port scanning utility for large networks
  brew 'nmap'

  ## Proxy & VPN
  # Free software for OpenVPN on OS X
  cask 'tunnelblick'
### }}}


### Utility {{{
  ## Compress/Uncompress
  # 7-Zip (high compression file archiver) implementation
  brew 'p7zip'
  # General-purpose data compression with high compression ratio
  brew 'xz'
### }}}


### Game {{{
  ## Emulator
  cask 'openemu'
### }}}


### Programming Language {{{
  ## Node.js
  # Platform built on V8 to build network applications
  brew 'node'
  # Alternative JavaScript package manager by Facebook
  brew 'yarn'

  ## Python
  # Python3
  brew 'python'
  # Python2
  brew 'python@2'

  ## Golang
  # Open source programming language to build simple/reliable/efficient software
  brew 'go'

  ## Java
  # Java Standard Edition Development Kit 8
  # INFO: Need to reboot
  cask 'java8'
  # Java build tool
  brew 'ant'
  # Java-based project management
  brew 'maven'

  ## C Family
  # GNU compiler collection
  brew 'gcc'

  ## Shellscript
  # Static analysis and lint tool, for (ba)sh scripts
  brew 'shellcheck'

  ## Lua
  # Powerful, lightweight programming language
  brew 'lua'
  # Just-In-Time Compiler (JIT) for the Lua programming language
  brew 'luajit'
  # Package manager for the Lua programming language
  brew 'luarocks'

  ## Ruby
  # Powerful, clean, object-oriented scripting language
  brew 'ruby'

  ## Verilog
  # Verilog simulation and synthesis tool
  brew 'icarus-verilog'
### }}}


### VCS {{{
  ## Git & GitHub
  # Distributed revision control system
  brew 'git'
  # Small git utilities
  brew 'git-extras'
  # OS X status bar application for Github
  cask 'gitee'
  # Extend your GitHub workflow beyond your browser <Paste>
  cask 'github'
  # The legendary Git GUI client
  cask 'gitkraken'

  ## Mercurial
  # Scalable distributed version control system
  brew 'mercurial'
### }}}


### Code Editor & IDE {{{
  ## Editors
  # Vim
  brew 'neovim'
  # Microsoft Visual Studio Code
  cask 'visual-studio-code'

  ## IDE
  # JetBrain
  cask 'webstorm'
  cask 'intellij-idea'
### }}}


### Terminal {{{
  # Terminal Emulator for macOS
  cask 'iterm2'
  # Opens a terminal window to the current directory in Finder
  # INFO: Need to set up manually
  cask 'go2shell'
#}}}


### Database {{{
  ## SQL
  cask 'datagrip'

  ## Key-Value DB
  # Persistent key-value database, with built-in net interface
  brew 'redis'

  ## LDAP
  # The Eclipse-based LDAP browser and directory client
  cask 'apache-directory-studio'
### }}}


### Virtualization {{{
  ## Virtual Machine
  # Oracle VirtualBox
  # INFO: Need to enable their kernel extension
  cask 'virtualbox'

  ## Container
  # Docker Community Edition for Mac (Edge)
  cask 'docker-edge'
### }}}


### DevOps {{{
  # Tool for building and managing virtual machine environments
  cask 'vagrant'
  # Manage your vagrant machines in one place
  cask 'vagrant-manager'
### }}}

### Cryptography {{{
  # Enhanced version of john, a UNIX password cracker
  brew 'john-jumbo'
  # Suite of barcodes-reading tools
  brew 'zbar'
### }}}

### Font {{{
  # XML-based font configuration API for X Windows
  brew 'fontconfig'

### }}}
